######################
#######STARTING#######
######################
Reading data
   bkg.shape=(713001, 47)
   sig1.shape=(98494, 47)
   sig2.shape=(99077, 47)

Preparing GAN-AE
   Sbkg.shape=(713001, 47)
   Ssig1.shape=(98494, 47)
   Ssig2.shape=(99077, 47)
   Saux.shape=(713001,)
Training GAN-AE
Model: "Encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
En_input (InputLayer)        [(None, 47)]              0         
_________________________________________________________________
encode1 (Dense)              (None, 30)                1440      
_________________________________________________________________
dropout (Dropout)            (None, 30)                0         
_________________________________________________________________
re_lu (ReLU)                 (None, 30)                0         
_________________________________________________________________
encode2 (Dense)              (None, 20)                620       
_________________________________________________________________
dropout_1 (Dropout)          (None, 20)                0         
_________________________________________________________________
re_lu_1 (ReLU)               (None, 20)                0         
_________________________________________________________________
En_code (Dense)              (None, 10)                210       
=================================================================
Total params: 2,270
Trainable params: 2,270
Non-trainable params: 0
_________________________________________________________________

Model: "Decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
De_input (InputLayer)        [(None, 10)]              0         
_________________________________________________________________
encode1 (Dense)              (None, 20)                220       
_________________________________________________________________
dropout_2 (Dropout)          (None, 20)                0         
_________________________________________________________________
re_lu_2 (ReLU)               (None, 20)                0         
_________________________________________________________________
encode2 (Dense)              (None, 30)                630       
_________________________________________________________________
dropout_3 (Dropout)          (None, 30)                0         
_________________________________________________________________
re_lu_3 (ReLU)               (None, 30)                0         
_________________________________________________________________
De_outout (Dense)            (None, 47)                1457      
=================================================================
Total params: 2,307
Trainable params: 2,307
Non-trainable params: 0
_________________________________________________________________

Model: "Generator (AE)"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Gen_input (InputLayer)       [(None, 47)]              0         
_________________________________________________________________
Encoder (Model)              (None, 10)                2270      
_________________________________________________________________
Decoder (Model)              (None, 47)                2307      
=================================================================
Total params: 4,577
Trainable params: 4,577
Non-trainable params: 0
_________________________________________________________________

Model: "Discriminant"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 47)]              0         
_________________________________________________________________
Dis1 (Dense)                 (None, 150)               7200      
_________________________________________________________________
dropout_4 (Dropout)          (None, 150)               0         
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 150)               0         
_________________________________________________________________
Dis2 (Dense)                 (None, 100)               15100     
_________________________________________________________________
dropout_5 (Dropout)          (None, 100)               0         
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
Dis3 (Dense)                 (None, 50)                5050      
_________________________________________________________________
dropout_6 (Dropout)          (None, 50)                0         
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 50)                0         
_________________________________________________________________
Dis_output (Dense)           (None, 1)                 51        
=================================================================
Total params: 54,802
Trainable params: 27,401
Non-trainable params: 27,401
_________________________________________________________________

Model: "GAN_AE"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
GAN_input (InputLayer)          [(None, 47)]         0                                            
__________________________________________________________________________________________________
Encoder (Model)                 (None, 10)           2270        GAN_input[0][0]                  
__________________________________________________________________________________________________
Decoder (Model)                 (None, 47)           2307        Encoder[2][0]                    
__________________________________________________________________________________________________
aux_input (InputLayer)          [(None, 1)]          0                                            
__________________________________________________________________________________________________
Discriminant (Model)            (None, 1)            27401       Decoder[2][0]                    
==================================================================================================
Total params: 31,978
Trainable params: 4,577
Non-trainable params: 27,401
__________________________________________________________________________________________________
Doing loss plots
Applying GAN-AE
   test_data.shape=(198494, 47)
   label.shape=(198494,)
Applying GAN-AE
   test_data.shape=(199077, 47)
   label.shape=(199077,)
Saving GAN-AE
    saving a single model
